wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"

#include <stdio.h>
#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define APP_BUTTON_X               350U
#define APP_BUTTON_Y                80U
#define APP_BUTTON_WIDTH           110U
#define APP_BUTTON_HEIGHT           90U

#define APP_RECORD_X                10U
#define APP_RECORD_Y                56U
#define APP_RECORD_WIDTH           315U
#define APP_RECORD_HEIGHT          200U
#define APP_RECORD_LINE_HEIGHT      24U

#define APP_MAX_RECORDS              8U
#define APP_RECORD_TEXT_LENGTH      48U

#define APP_TOUCH_DEBOUNCE_MS      200U

#define RTC_INIT_MAGIC 0x32F2U

#define RTC_INIT_MAGIC       0x32F3U

#define SET_MINUS_X          10U
#define SET_PLUS_X           125U
#define SET_NEXT_X           240U
#define SET_SAVE_X           355U

#define SET_BUTTON_Y         180U
#define SET_BUTTON_WIDTH     110U
#define SET_BUTTON_HEIGHT     60U

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma location=0x2004c000
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
#pragma location=0x2004c0a0
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __CC_ARM )  /* MDK ARM Compiler */

__attribute__((at(0x2004c000))) ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
__attribute__((at(0x2004c0a0))) ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __GNUC__ ) /* GNU Compiler */

ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDecripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection")));   /* Ethernet Tx DMA Descriptors */
#endif

ETH_TxPacketConfig TxConfig;

ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

ETH_HandleTypeDef heth;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SD_HandleTypeDef hsd1;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

static TS_StateTypeDef appTouchState;

static char appPressRecords
    [APP_MAX_RECORDS]
    [APP_RECORD_TEXT_LENGTH];

static uint8_t appRecordCount = 0U;
static uint32_t appTotalPressCount = 0U;

static uint32_t appLastPressTick = 0U;

typedef enum
{
    APP_FIELD_YEAR = 0,
    APP_FIELD_MONTH,
    APP_FIELD_DAY,
    APP_FIELD_HOUR,
    APP_FIELD_MINUTE,
    APP_FIELD_SECOND,
    APP_FIELD_COUNT
} APP_TimeFieldTypeDef;

static uint16_t setupYear = 2026U;
static uint8_t setupMonth = 1U;
static uint8_t setupDay = 1U;
static uint8_t setupHour = 0U;
static uint8_t setupMinute = 0U;
static uint8_t setupSecond = 0U;

static APP_TimeFieldTypeDef setupField = APP_FIELD_YEAR;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_ETH_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI2_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

static void APP_Init(void);
static void APP_Run(void);
static void APP_DrawInterface(void);
static void APP_DrawButton(uint8_t pressed);
static void APP_RedrawRecords(void);
static void APP_AddRecord(void);
static void APP_ProcessTouch(void);
static uint8_t APP_IsInsideButton(uint16_t x, uint16_t y);

