wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
static void APP_TimeSetupScreen(void);
static void APP_DrawTimeSetupScreen(void);
static void APP_DrawSetupButton(
    uint16_t x,
    uint16_t y,
    uint16_t width,
    uint16_t height,
    const char *text);

static void APP_AdjustTime(int8_t direction);
static HAL_StatusTypeDef APP_SaveRtcTime(void);
static void APP_LoadRtcTime(void);

static uint8_t APP_PointInRect(
    uint16_t touchX,
    uint16_t touchY,
    uint16_t rectX,
    uint16_t rectY,
    uint16_t rectWidth,
    uint16_t rectHeight);

static uint8_t APP_DaysInMonth(
    uint16_t year,
    uint8_t month);

static uint8_t APP_CalculateWeekDay(
    uint16_t year,
    uint8_t month,
    uint8_t day);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
static uint8_t APP_PointInRect(
    uint16_t touchX,
    uint16_t touchY,
    uint16_t rectX,
    uint16_t rectY,
    uint16_t rectWidth,
    uint16_t rectHeight)
{
    if ((touchX >= rectX) &&
        (touchX < (rectX + rectWidth)) &&
        (touchY >= rectY) &&
        (touchY < (rectY + rectHeight)))
    {
        return 1U;
    }

    return 0U;
}


static uint8_t APP_DaysInMonth(
    uint16_t year,
    uint8_t month)
{
    static const uint8_t days[] =
    {
        31U, 28U, 31U, 30U, 31U, 30U,
        31U, 31U, 30U, 31U, 30U, 31U
    };

    uint8_t result;

    if ((month < 1U) || (month > 12U))
    {
        return 31U;
    }

    result = days[month - 1U];

    if (month == 2U)
    {
        if (((year % 400U) == 0U) ||
            (((year % 4U) == 0U) &&
             ((year % 100U) != 0U)))
        {
            result = 29U;
        }
    }

    return result;
}


/*
 * 返回值符合 STM32 RTC：
 * Monday = 1 ... Sunday = 7
 */
static uint8_t APP_CalculateWeekDay(
    uint16_t year,
    uint8_t month,
    uint8_t day)
{
    static const uint8_t table[] =
    {
        0U, 3U, 2U, 5U, 0U, 3U,
        5U, 1U, 4U, 6U, 2U, 4U
    };

    uint32_t weekDay;

    if (month < 3U)
    {
        year--;
    }

    weekDay =
        (year +
         (year / 4U) -
         (year / 100U) +
         (year / 400U) +
         table[month - 1U] +
         day) % 7U;

    if (weekDay == 0U)
    {
        return RTC_WEEKDAY_SUNDAY;
    }

    return (uint8_t)weekDay;
}


static void APP_LoadRtcTime(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    /*
     * RTC 已经设置过时，使用当前 RTC 值作为界面初始值。
     */
    if (HAL_RTCEx_BKUPRead(
            &hrtc,
            RTC_BKP_DR0) == RTC_INIT_MAGIC)
    {
        if (HAL_RTC_GetTime(
                &hrtc,
                &rtcTime,
                RTC_FORMAT_BIN) == HAL_OK)
        {
            if (HAL_RTC_GetDate(
                    &hrtc,
                    &rtcDate,
                    RTC_FORMAT_BIN) == HAL_OK)
            {
                setupYear = 2000U + rtcDate.Year;
                setupMonth = rtcDate.Month;
                setupDay = rtcDate.Date;
                setupHour = rtcTime.Hours;
                setupMinute = rtcTime.Minutes;
                setupSecond = rtcTime.Seconds;

                return;
            }
        }
    }

    /*
     * RTC 尚未设置时使用默认值。
     */
    setupYear = 2026U;
    setupMonth = 1U;
    setupDay = 1U;
    setupHour = 0U;
    setupMinute = 0U;
    setupSecond = 0U;
}


static void APP_DrawSetupButton(
    uint16_t x,
    uint16_t y,
    uint16_t width,
    uint16_t height,
    const char *text)
{
    uint16_t textWidth;
    uint16_t textX;
    uint16_t textY;

    BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(x, y, width, height);

    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DrawRect(x, y, width, height);

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

    textWidth = (uint16_t)(strlen(text) * Font16.Width);

    if (textWidth < width)
    {
        textX = x + ((width - textWidth) / 2U);
    }
    else
    {
        textX = x + 2U;
    }

    textY = y + ((height - Font16.Height) / 2U);

    BSP_LCD_DisplayStringAt(
        textX,
        textY,
        (uint8_t *)text,
        LEFT_MODE
    );
}


static void APP_DrawTimeSetupScreen(void)
{
    static const char *fieldNames[] =
    {
        "YEAR",
        "MONTH",
        "DAY",
        "HOUR",
        "MINUTE",
        "SECOND"
    };

    char text[50];

    BSP_LCD_Clear(LCD_COLOR_WHITE);

    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    BSP_LCD_DisplayStringAt(
        0U,
        15U,
        (uint8_t *)"Set date and time",
        CENTER_MODE
    );

    snprintf(
        text,
        sizeof(text),
        "%04u-%02u-%02u  %02u:%02u:%02u",
        setupYear,
        setupMonth,
        setupDay,
        setupHour,
        setupMinute,
        setupSecond
    );

    BSP_LCD_SetFont(&Font20);

    BSP_LCD_DisplayStringAt(
        0U,
        65U,
        (uint8_t *)text,
        CENTER_MODE
    );

    snprintf(
        text,
        sizeof(text),
        "Editing: %s",
        fieldNames[setupField]
    );

    BSP_LCD_SetFont(&Font16);

    BSP_LCD_DisplayStringAt(
        0U,
        115U,
        (uint8_t *)text,
        CENTER_MODE
    );

    APP_DrawSetupButton(
        SET_MINUS_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "-"
    );

    APP_DrawSetupButton(
        SET_PLUS_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "+"
    );

    APP_DrawSetupButton(
        SET_NEXT_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "NEXT"
    );

    APP_DrawSetupButton(
        SET_SAVE_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "SAVE"
    );
}


