wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
static void APP_AdjustTime(int8_t direction)
{
    uint8_t maximumDay;

    switch (setupField)
    {
        case APP_FIELD_YEAR:
            if (direction > 0)
            {
                setupYear++;

                if (setupYear > 2099U)
                {
                    setupYear = 2000U;
                }
            }
            else
            {
                if (setupYear <= 2000U)
                {
                    setupYear = 2099U;
                }
                else
                {
                    setupYear--;
                }
            }
            break;

        case APP_FIELD_MONTH:
            if (direction > 0)
            {
                setupMonth++;

                if (setupMonth > 12U)
                {
                    setupMonth = 1U;
                }
            }
            else
            {
                if (setupMonth <= 1U)
                {
                    setupMonth = 12U;
                }
                else
                {
                    setupMonth--;
                }
            }
            break;

        case APP_FIELD_DAY:
            maximumDay =
                APP_DaysInMonth(setupYear, setupMonth);

            if (direction > 0)
            {
                setupDay++;

                if (setupDay > maximumDay)
                {
                    setupDay = 1U;
                }
            }
            else
            {
                if (setupDay <= 1U)
                {
                    setupDay = maximumDay;
                }
                else
                {
                    setupDay--;
                }
            }
            break;

        case APP_FIELD_HOUR:
            if (direction > 0)
            {
                setupHour =
                    (uint8_t)((setupHour + 1U) % 24U);
            }
            else
            {
                setupHour =
                    (setupHour == 0U) ? 23U :
                                       setupHour - 1U;
            }
            break;

        case APP_FIELD_MINUTE:
            if (direction > 0)
            {
                setupMinute =
                    (uint8_t)((setupMinute + 1U) % 60U);
            }
            else
            {
                setupMinute =
                    (setupMinute == 0U) ? 59U :
                                         setupMinute - 1U;
            }
            break;

        case APP_FIELD_SECOND:
            if (direction > 0)
            {
                setupSecond =
                    (uint8_t)((setupSecond + 1U) % 60U);
            }
            else
            {
                setupSecond =
                    (setupSecond == 0U) ? 59U :
                                         setupSecond - 1U;
            }
            break;

        default:
            break;
    }

    /*
     * 调整年份或月份后，避免出现 2 月 31 日。
     */
    maximumDay = APP_DaysInMonth(
        setupYear,
        setupMonth
    );

    if (setupDay > maximumDay)
    {
        setupDay = maximumDay;
    }
}


static HAL_StatusTypeDef APP_SaveRtcTime(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    rtcTime.Hours = setupHour;
    rtcTime.Minutes = setupMinute;
    rtcTime.Seconds = setupSecond;
    rtcTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
    rtcTime.StoreOperation = RTC_STOREOPERATION_RESET;

    if (HAL_RTC_SetTime(
            &hrtc,
            &rtcTime,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    rtcDate.WeekDay = APP_CalculateWeekDay(
        setupYear,
        setupMonth,
        setupDay
    );

    rtcDate.Month = setupMonth;
    rtcDate.Date = setupDay;
    rtcDate.Year = (uint8_t)(setupYear - 2000U);

    if (HAL_RTC_SetDate(
            &hrtc,
            &rtcDate,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    HAL_RTCEx_BKUPWrite(
        &hrtc,
        RTC_BKP_DR0,
        RTC_INIT_MAGIC
    );

    return HAL_OK;
}


static void APP_TimeSetupScreen(void)
{
    TS_StateTypeDef touchState = {0};

    uint8_t touching;
    uint8_t previousTouching = 0U;
    uint8_t setupFinished = 0U;

    uint16_t touchX;
    uint16_t touchY;

    APP_LoadRtcTime();
    setupField = APP_FIELD_YEAR;

    APP_DrawTimeSetupScreen();

    while (setupFinished == 0U)
    {
        if (BSP_TS_GetState(&touchState) == TS_OK)
        {
            touching =
                (touchState.touchDetected > 0U) ?
                1U : 0U;

            /*
             * 只处理刚按下的瞬间。
             */
            if ((touching != 0U) &&
                (previousTouching == 0U))
            {
                touchX = touchState.touchX[0];
                touchY = touchState.touchY[0];

                if (APP_PointInRect(
                        touchX,
                        touchY,
                        SET_MINUS_X,
                        SET_BUTTON_Y,
                        SET_BUTTON_WIDTH,
                        SET_BUTTON_HEIGHT) != 0U)
                {
                    APP_AdjustTime(-1);
                    APP_DrawTimeSetupScreen();
                }
                else if (APP_PointInRect(
                             touchX,
                             touchY,
                             SET_PLUS_X,
                             SET_BUTTON_Y,
                             SET_BUTTON_WIDTH,
                             SET_BUTTON_HEIGHT) != 0U)
                {
                    APP_AdjustTime(1);
                    APP_DrawTimeSetupScreen();
                }
                else if (APP_PointInRect(
                             touchX,
                             touchY,
                             SET_NEXT_X,
                             SET_BUTTON_Y,
                             SET_BUTTON_WIDTH,
                             SET_BUTTON_HEIGHT) != 0U)
                {
                    setupField =
                        (APP_TimeFieldTypeDef)
                        ((setupField + 1U) %
                         APP_FIELD_COUNT);

