wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
                    APP_DrawTimeSetupScreen();
                }
                else if (APP_PointInRect(
                             touchX,
                             touchY,
                             SET_SAVE_X,
                             SET_BUTTON_Y,
                             SET_BUTTON_WIDTH,
                             SET_BUTTON_HEIGHT) != 0U)
                {
                    if (APP_SaveRtcTime() == HAL_OK)
                    {
                        BSP_LCD_Clear(LCD_COLOR_WHITE);

                        BSP_LCD_SetFont(&Font20);
                        BSP_LCD_SetBackColor(
                            LCD_COLOR_WHITE);
                        BSP_LCD_SetTextColor(
                            LCD_COLOR_GREEN);

                        BSP_LCD_DisplayStringAt(
                            0U,
                            110U,
                            (uint8_t *)"RTC SAVED",
                            CENTER_MODE
                        );

                        HAL_Delay(500);
                        setupFinished = 1U;
                    }
                }
            }

            previousTouching = touching;
        }

        HAL_Delay(20);
    }
}

static void APP_Init(void)
{
    /*
     * 初始化 LCD。
     */
    if (BSP_LCD_Init() != LCD_OK)
    {
        Error_Handler();
    }

    /*
     * LCD framebuffer 位于外部 SDRAM。
     */
    BSP_LCD_LayerDefaultInit(
        0U,
        LCD_FB_START_ADDRESS
    );

    BSP_LCD_SelectLayer(0U);
    BSP_LCD_SetLayerVisible(0U, ENABLE);
    BSP_LCD_DisplayOn();

    /*
     * 初始化触摸屏。
     */
    if (BSP_TS_Init(
            BSP_LCD_GetXSize(),
            BSP_LCD_GetYSize()) != TS_OK)
    {
        BSP_LCD_Clear(LCD_COLOR_WHITE);

        BSP_LCD_SetFont(&Font20);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        BSP_LCD_SetTextColor(LCD_COLOR_RED);

        BSP_LCD_DisplayStringAt(
            0U,
            110U,
            (uint8_t *)"Touch init failed",
            CENTER_MODE
        );

        Error_Handler();
    }

/*
 * 每次开机先进入时间设置页面。
 */
APP_TimeSetupScreen();

/*
 * 保存时间后进入按钮记录页面。
 */
APP_DrawInterface();

appLastPressTick =
    HAL_GetTick() - APP_TOUCH_DEBOUNCE_MS;
}


static void APP_Run(void)
{
    while (1)
    {
        APP_ProcessTouch();

        /*
         * 每 10ms 读取一次触摸屏。
         */
        HAL_Delay(10);
    }
}


static void APP_DrawInterface(void)
{
    BSP_LCD_Clear(LCD_COLOR_WHITE);

    /*
     * 左侧标题。
     */
    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    BSP_LCD_DisplayStringAt(
        10U,
        10U,
        (uint8_t *)"Button press records:",
        LEFT_MODE
    );

    BSP_LCD_DisplayStringAt(
        10U,
        34U,
        (uint8_t *)"No.  YYYY-MM-DD HH:MM:SS",
        LEFT_MODE
    );

    /*
     * 左右区域分隔线。
     */
    BSP_LCD_SetTextColor(LCD_COLOR_GRAY);

    BSP_LCD_DrawVLine(
        337U,
        8U,
        255U
    );

    APP_DrawButton(0U);
    APP_RedrawRecords();
}


static void APP_DrawButton(uint8_t pressed)
{
    uint32_t buttonColor;

    if (pressed != 0U)
    {
        buttonColor = LCD_COLOR_DARKBLUE;
    }
    else
    {
        buttonColor = LCD_COLOR_BLUE;
    }

    /*
     * 填充按钮。
     */
    BSP_LCD_SetTextColor(buttonColor);

    BSP_LCD_FillRect(
        APP_BUTTON_X,
        APP_BUTTON_Y,
        APP_BUTTON_WIDTH,
        APP_BUTTON_HEIGHT
    );

    /*
     * 绘制按钮边框。
     */
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    BSP_LCD_DrawRect(
        APP_BUTTON_X,
        APP_BUTTON_Y,
        APP_BUTTON_WIDTH,
        APP_BUTTON_HEIGHT
    );

    /*
     * 显示按钮文字。
     */
    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetBackColor(buttonColor);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

    BSP_LCD_DisplayStringAt(
        APP_BUTTON_X + 24U,
        APP_BUTTON_Y + 34U,
        (uint8_t *)"PRESS",
        LEFT_MODE
    );

    /*
     * 恢复文字设置。
     */
    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
}


static uint8_t APP_IsInsideButton(
    uint16_t x,
    uint16_t y)
{
    if ((x >= APP_BUTTON_X) &&
        (x < (APP_BUTTON_X + APP_BUTTON_WIDTH)) &&
        (y >= APP_BUTTON_Y) &&
        (y < (APP_BUTTON_Y + APP_BUTTON_HEIGHT)))
    {
        return 1U;
    }

    return 0U;
}

static void APP_AddRecord(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    uint8_t recordIndex;
    uint32_t fullYear;

    /*
     * 必须先读取时间，再读取日期。
     *
     * 读取时间后，RTC 的日历影子寄存器会锁定；
     * 读取日期后才会解锁。
     */
    if (HAL_RTC_GetTime(
            &hrtc,
            &rtcTime,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return;
    }

    if (HAL_RTC_GetDate(
            &hrtc,
            &rtcDate,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return;
    }

    fullYear = 2000U + rtcDate.Year;

    appTotalPressCount++;

    if (appRecordCount < APP_MAX_RECORDS)
    {
        recordIndex = appRecordCount;
        appRecordCount++;
    }
    else
    {
        /*
         * 记录区域已满：
         * 删除最早的一条记录。
         */
        memmove(
            appPressRecords[0],
            appPressRecords[1],
            (APP_MAX_RECORDS - 1U) *
                APP_RECORD_TEXT_LENGTH
        );

        recordIndex = APP_MAX_RECORDS - 1U;
    }

    snprintf(
        appPressRecords[recordIndex],
        APP_RECORD_TEXT_LENGTH,
        "%03lu  %04lu-%02u-%02u %02u:%02u:%02u",
        (unsigned long)appTotalPressCount,
        (unsigned long)fullYear,
        (unsigned int)rtcDate.Month,
        (unsigned int)rtcDate.Date,
        (unsigned int)rtcTime.Hours,
        (unsigned int)rtcTime.Minutes,
        (unsigned int)rtcTime.Seconds
    );

    APP_RedrawRecords();
}


static void APP_RedrawRecords(void)
{
    uint8_t i;

